README.org
* lyricssongs


** 概要

[[http://www7b.biglobe.ne.jp/~lyricssongs/index.htm][　梅丘歌曲会館 　詩と音楽　]]の作曲家別の作品集を latex 化するための　ruby スクリプト

** 必要なもの

- git 環境
- ruby 環境
- JUMAN

*** git 環境

- これを読めるので基本的な git 環境は OK です

- スクリプト内部よりローカルな git リポジトリを作成するため、 git
  config で以下の二つを登録

  #+BEGIN_SRC
  git config --global user.email "you@example.com"
  git config --global user.name "Your Name"
  #+END_SRC

*** ruby 環境

- html 情報から各種情報を取り出すため ruby nokogiri を利用します

  - scoop install ruby / brew install ruby / 他
  - gem install tomlrb nokogiri git
    - 利用する gem パッケージは scripts/Gemfile 参照

*** JUMAN

- 邦訳された作品タイトル名の索引情報作成に、その「ひらがな化」が必要
- 和文の形態要素解析プログラムは、漢字の「よみ」も生成するのでこれを利用
- mecab juman jumanpp などがあるが windows macOS ともにプリコンパイル
  されたものが存在する juman を使うことにした
  - ただし開発当初は jumanpp を利用していたが、リリースに間に合わないので
    「よみ」情報を手動でキャッシュとして蓄えて利用する

- URL [[https://nlp.ist.i.kyoto-u.ac.jp/?JUMAN][ 日本語形態素解析システム JUMAN ]]

- インストール
 - [ ] [[https://github.com/ku-nlp/juman][JUMAN 開発版]] (at GitHub)
 - [ ] [[https://nlp.ist.i.kyoto-u.ac.jp/DLcounter/lime.cgi?down=https://nlp.ist.i.kyoto-u.ac.jp/nl-resource/juman/juman-7.01.tar.bz2&name=juman-7.01.tar.bz2][JUMAN  Ver.7.01]] (bzip2圧縮; 4,286,891 bytes)
 - [ ] [[https://nlp.ist.i.kyoto-u.ac.jp/DLcounter/lime.cgi?down=https://nlp.ist.i.kyoto-u.ac.jp/nl-resource/juman/juman-7.0-x86-installer.exe&name=juman-7.0-x86-installer.exe][JUMAN  Ver.7.0 (Windows 32bit版)]] (インストーラ付; 8,276,060 bytes)
 - [X] [[https://nlp.ist.i.kyoto-u.ac.jp/DLcounter/lime.cgi?down=https://nlp.ist.i.kyoto-u.ac.jp/nl-resource/juman/juman-7.0-x64-installer.exe&name=juman-7.0-x64-installer.exe][JUMAN  Ver.7.0 (Windows 64bit版)]] (インストーラ付; 8,330,604 bytes)
 - [ ] [[https://nlp.ist.i.kyoto-u.ac.jp/DLcounter/lime.cgi?down=https://nlp.ist.i.kyoto-u.ac.jp/nl-resource/knp/20090930-juman-knp.ppt&name=20090930-juman-knp.ppt][JUMAN/KNPのチュートリアルのスライド]]
       (京都大学学術情報メディアセンター, メディア情報処理専修コース「自然言語処理技術」, 2009/09/30)
- PATH に「 C:\Program Files (x86)\juman 」を追記しリブート

   #+BEGIN_SRC
   C:\Program Files\juman\COPYING
   C:\Program Files\juman\dic
   C:\Program Files\juman\juman.exe
   C:\Program Files\juman\manual.pdf
   C:\Program Files\juman\unins000.dat
   C:\Program Files\juman\unins000.exe
   #+END_SRC

** 利用方法

- TOML ファイルの用意

  TOML ディレクトリのサンプル TOML ファイルを参考に [[http://www7b.biglobe.ne.jp/~lyricssongs/COMP/CIDX_DE.htm][作曲家リスト（国・
  地域別）]] などから作家情報を作成

- TOML ファイルを利用して htm ファイルをダウンロード

  #+BEGIN_SRC
  ruby scripts/00-lyricssongs-download.rb TOML/Brahms.toml ...
  #+END_SRC

  - 初回ダウンロード時は一件あたり 5 秒間隔でダウンロード

  - 作曲家情報は COMP / 作品情報は TEXT ディレクトリに格納

- htm ファイルの tex 化と latex によるテスト＆対策
  - ダウンロードした htm ファイルを tex 化

    #+BEGIN_SRC
    ruby scripts/20-lyricssongs-tex-gen.rb  TOML/Brahms.toml ...
    #+END_SRC

    - scripts/10-lyricssongs-tex-gen.rb は廃止の予定です

    - 上記の処理で、 作曲家毎に各ディレクトリに LaTeX に必要なものが書き込まれます。
    - Brams を例にとれば以下のようなものが作成されます。
      - Brahms.tex
      - Brahms-hyper-link.tex
      - Bramas-V-001.tex ....
      - Sxxxx.tex ...  ( 今まで op に置いていたもの )

- latex などでビルド

    #+BEGIN_SRC
    mkdir out
    llmk Brahms/Brahms
    #+END_SRC

- 現在判明していること


** TODO

- [X] juman 対応
- [ ] style macro の見直し
- [ ] Op 番号、作品番号の表示が　 Op.Op などとなるなど　とおかしい
  - Op 番号なしなどがたくさんあるので
  - 他の作者では Op 番号や WoO 番号が無い、あるいはそのほかの記号があるので、対応検討中（アイデア募集）
- [ ] 予想外のデータ対策（これは当分は終結はしないだろう）
  - [ ] 下線（アンダースコア）のデータあり、暫定で \_ で対応
- [ ] Brahms の 299 ページ目で、現代のタイトルが行溢れしています
- [ ] Windows 環境で「警告？(guessed encoding: UTF-8 = utf8) 」

  - [[https://github.com/MiKTeX/miktex/issues/1137][uplatex guess encoding wrong #1137]]
    [[https://github.com/MiKTeX/miktex/issues/1137#issuecomment-1197987983][edocevoli commented on Jul 28, 2022]]

    This "input encoding" guessing was only implemented on Windows. In
    June, the Windows implementation was ported and is now available
    in the latest pTeX binaries which TeX Live 2022 not yet
    provides. MiKTeX provides the new implementation. Maybe the
    implementation is wrong in some way. I cannot tell. This must be
    fixed upstream.

   → 次期バージョンで解消できるといいな

  - [ ] Wolf で「>>」...「<<」が html encoding された &lt; &gt; になっているので LaTeX エラーが生じている
